{
  "ebooks": [
    {
      "id": "ebook-1",
      "name": "Charlie wade",
      "type": "folder",
      "children": [
        {
          "id": "episode-20-25",
          "name": "Charlie Wade - Episode 20-25",
          "type": "file",
          "content": "Chapter 20\r\nWhen Wendell fled, Harold just came in, followed by his sister Wendy and his fiance Yunlong White.\n\nBeside Yunlong, there was also a young man dressed in luxurious clothes. Looking at his face, he looked a bit like Gerald.\r\n\r\nWhen he met Wendell head-on, Harold said hurriedly: 'Oh, brother Wendell! When I just came in, I heard someone say something happened to your family? Really?'\r\n\r\nWendell pushed him away in despair, muttering in his mouth: 'It's over, it's over, it's all over'\r\n\r\nHarold asked with concern: 'Mr. Jones, what's wrong with you?' Wendell shook his head in fear, dare not say anything.\r\nHe had no doubt that if he said something that he shouldn't say, he might be corpse on the street tomorrow.\r\n\r\nSo Wendell broke away from Harold's hand and ran out in despair.\r\n\r\nHarold looked at his back and sighed, 'I guess this house is really finished, sh!t, too soon, right? It was fine yesterday, but today it is bankrupt!'\r\n\r\nLater, when Harold saw Charlie and Claire, he was moved with bad thoughts, and\r\nhurriedly greeted Claire, 'Claire, I will introduce you to this distinguished guest. This is Gerald's cousin, Fred White. , The eldest son of the White family.'\r\n\r\n'Brother Fred, this is my cousin, Claire.' Harold introduced to Fred with a flattering expression.\r\n\r\nAs soon as Fred came in, his eyes were tightly focused on Claire. Hearing the words, he quickly stretched out his hand and said: 'Hello Claire. I have heard about the beauty of the daughter of the Willson family a long time ago. Seeing it today, it really deserves its reputation.'\r\n\r\nA trace of dissatisfaction flashed in Charlie's eyes. There was no way for his wife to be beautiful, and the flies around her would be annoying to death after catching one after another.\r\n\r\nSo he stretched out his hand first, shook hands with Fred, and said coldly: 'Hello, I am Claire's husband.'\r\n\r\n'You?' Fred looked up and down at Charlie, his disdain was overwhelming, and he\r\nwithdrew his hand before he said indifferently: 'I didn't expect Claire to be married. It's really a flower on the cow dung.'\r\n\r\nWendy quickly explained on the side: 'Brother Fred, this rubbish is imported into our Willson family. He has no job and no ability!'\r\n\r\nAfter finishing speaking, she deliberately winked at Fred and said, 'Brother Fred, after I marry Gerald, we will be considered as a family, and we must have more contact by\r\nthen.'\r\n\r\nFred naturally knew what she meant. This was to encourage him to pursue Claire. Then he smiled and said, 'Miss Claire is as beautiful as an immortal. If I can communicate more, I can't ask for it.'\r\n\r\nAt this moment, Charlie also saw his mother-in-law Elaine and father-in-law Jacob approaching.\r\n\r\nAfter Elaine walked over, he hurriedly said to Claire, 'Claire, have you heard about it? Jones family is bankrupt!'\r\n\r\n'Huh?' Claire asked in surprise: 'When did it happen?'\r\n\r\n'Just now!' Elaine sighed: 'I thought you would divorce Charlie in the future, and you can be with Wendell, but now it's nothing to watch.'\r\n\r\nCharlie was very depressed, is this mother-in-law a fool? Don't know that the current son-in-law is the real son-in-law?\r\n\r\nAfter seeing Elaine, Fred hurried over and introduced himself: 'You must be Claire's mother, right? Auntie, I am Gerald's cousin Fred. You are so beautiful, no wonder you can give birth to Claire. Such a beautiful daughter.'\r\n\r\nWhen Elaine heard that Fred turned out to be Gerald's cousin, the eldest son of the White family, and the son of the rich family! Her eyes lit up and she said enthusiastically: 'Yes, I am Claire's mother. Are you and Claire friends?'\r\n\r\nFred nodded and smiled: 'Kind of friends, but I just met today!'\r\n\r\nElaine was full of joy, and quickly nodded and said: 'Everyone quickly find a place to sit, don't stand, Mr. White, you young people, you should have more contact in the future.'\r\n\r\n'Mom!' Claire exclaimed in dissatisfaction, preventing her mother from continuing.\r\n\r\nElaine was about to say something, Claire gave her a hand to remind everyone to pay attention to the stage.\r\n\r\nAt this time, Mrs. Willson was already standing in the spotlight!\r\n\r\nShe looked around with excitement before she stood in front of the microphone and smiled and said: 'First of all, on behalf of the Willson family, I welcome dear friends and partners to come to our banquet.'\r\n\r\n'Then, let us welcome the Vice Chairman of Emgrand Group, Ms. Doris.'\r\n\r\nThe spotlight moved instantaneously, hitting the beam of light on the front seat.\r\n\r\nWearing a black evening dress, Doris completely exposed her perfect figure to everyone's eyes. Under the light, she was as dazzling as a fairy, and all the men in the field couldn't help but focus on her.\r\n\r\nEmgrand Group, Vice Chairman! Peerless beauty! Each of these identities is enough to attract everyone's attention.\r\n\r\nAfter Doris stood up, she just nodded to the crowd. When she saw Charlie, her eyes stayed for a while before she moved away.\r\n\r\nAt this time, the Old Mrs. Willson continued to speak: 'Today, I would like to thank the Emgrand Group for being able to entrust such an important project to the Willson\r\nfamily. The Willson family will definitely go all out to live up to the trust of Emgrand.'\r\n\r\n'Secondly, we also want to introduce to our friends an outstanding junior of our Willson family. If it weren't for him, we would not have reached a cooperation with Emgrand.\r\nMoreover, after mutual consultation of our group, we decided to nominate him as our Willson Group's Director, is solely responsible for the cooperation with Emgrand Group!'\r\n\r\nThe mother-in-law Elaine said excitedly: 'Oh, Claire! It's time for you to be on stage!'\r\n\r\nAlthough Claire was ready to take the stage, she was still nervous. Charlie immediately cast an encouraging look at her.\r\nHarold looked at Claire who was full of excitement, and couldn't help but show a sneer at the corner of his mouth.\r\n\r\nOld Mrs. Willson also looked at the table and spoke with a smile. 'Let us welcome the new director of the Willson Group, Harold!' Claire's figure instantly froze in place\r\nShe looked to the side in disbelief, but saw Harold proudly and stepped onto the stage. Charlie's eyes turned cold instantly.\r\nA good way to cross the river and demolish the bridge!\r\n\r\nThe Willson family, after using Claire, immediately abandoned her, not caring about her feelings at all!\r\n\r\nClaire's eye circles instantly turned red, and tears kept rolling in his eye sockets. Immediately afterward, she stood up and ran out of the door without looking back. For her, how happy she was when she came, how desperate she was now!\r\nCharlie watched her leave, his face even colder. Bullying my wife? Are you looking for death?\r\nAt this time, Harold stood on the stage and said proudly: 'Thank you for the trust of the company, I will definitely work hard to be a director! I will definitely complete the project given to us by Emgrand Group!'\r\n\r\nMrs. Willson nodded in satisfaction, took the words, and said: 'There is one more important thing about this banquet, that is, we are fortunate to have Mr. Wade, the new chairman of the Emgrand Group! Please use the warmest Applause, welcome to\r\nChairman Wade!'\r\n\r\nThere was thunderous applause from the audience!\r\n\r\nAll the guests tonight are rushing to the new chairman of Emgrand Group! Everyone is waiting to see his style!\r\nEveryone is watching privately, just want to see, who will stand up at this moment!\r\n\r\nSomeone even said: 'I suspect that the mysterious chairman of the Emgrand Group is the same person as the super goddess who made a lot of noise at Rare Earth on the Internet!'\r\n\r\n'I also think it's very possible! That super hero's back looks strange, it shouldn't be in the Aurous Hill circle!'\r\n\r\n'God! If you say that, isn't the chairman of Emgrand Group the most powerful super-rich in Aurous Hill?'\r\n\r\n'I look forward to seeing him in his true colors!'\r\n\r\nIn this fierce applause, under the eager attention of countless people, Charlie suddenly, with cold his face and slowly stood up\r\n\r\nChapter 21\r\nIn everyone's incredible eyes, Charlie slowly stood up.\r\n\r\nThe eyes of the entire banquet hall focused on him in an instant.\r\n\r\n'Charlie, what are you doing! Sit down!' Elaine quickly reminded him in fright.\r\n\r\nHe didn't look at what occasion it was! There are so many big men present, none of them dared to stand up, you Charlie are a wasteful son-in-law, what makes you think the limelight at this time is for you?\r\n\r\nFred and Gerald also glanced at each other, secretly saying in their hearts, d*mn, the chairman of the Emgrand Group would really be him, right?\r\n\r\nBut then, the two shook their heads again.\r\n\r\nImpossible, if he is really the chairman of Emgrand, how could he be scolded by Elaine?\r\n\r\n'What are you rubbish! sit down in your place!' Harold shouted from the stage with a dark face.\r\n\r\nCharlie glanced at him coldly, then walked straight to Doris Young, completely ignoring everyone's horrified gaze, and whispered a few words in her ear.\r\n\r\nWhile listening, Doris Young nodded slightly.\r\n\r\nThis scene made everyone's heart tighten instantly.\r\n\r\nDoris Young! The vice-chairman of Emgrand Group, the famous beauty of Aurous Hill City! Charlie, a wasteful son-in-law, how could he know her? And looking like this, the relationship between the two seems pretty good.\r\n\r\nAfter speaking, Charlie stepped out of the hall regardless of everyone's gaze, focused on him, he went out to chase Claire.\r\n\r\nBut Doris Young stood up, stepped onto the stage, took the microphone, and said in the blank eyes of everyone: 'Hello everyone, this is Doris Young. Mr. Charlie was outside the venue before and met our chairman. He brought me a world.'\r\n\r\nWhen everyone heard that Charlie was not the chairman of Emgrand, they were relieved.\r\n\r\nFred White breathed a sigh of relief and whispered disdainfully: 'It's just that he met someone once, so he tried desperately to cheat on the assistant. It's really rubbish.'\r\n\r\nGerald White shrugged and said with a smile: 'This is how the little guy is.'\r\n\r\nAt this time, Doris Young on the stage glanced at Mrs. Willson, her face turned cold: 'The chairman asked me to inform you.'\r\n\r\n'From now on, Emgrand Group terminates its cooperation with Willson's, and the signed contract is declared invalid!'\r\n\r\n'boom!'\r\n\r\nThe crowd exploded in an instant, and no one expected that Doris Young would say such a thing.\r\n\r\nThis sudden change made everyone stunned.\r\n\r\nOld Mrs. Willson paled instantly and asked eagerly: 'Dear vice-chair, what is this? Is there anything in our Willson family that is wrong?'\r\n\r\nToday, she invited all the people in Aurora Hill with good repute, hoping to take this opportunity to become famous in Aurous Hill.\r\n\r\nIf under all the eyes of everyone, the Willson family would be stepped on the soles of their feet if they cooperated.\r\n\r\nDoris Young said: 'This project was originally our chairman's approval of Ms. Claire before cooperating with you, but you made your own claim and asked an inexplicable person to take charge of this project. Sorry, we don't accept it!'\r\n\r\nAfter speaking, Doris Young put down the microphone and walked out the door without looking back.\r\n\r\nOld Mrs. Willson's face was pale, and she slumped on the stage for an instant.\r\n\r\nShe never dreamed that her momentary cleverness would have ruined this golden opportunity for good!\r\n\r\nHad she known this situation a long time ago, she would not have allow Harold to replace Claire's directorship.\r\n\r\nHarold was also very at a loss this time, what's the matter? It seems that Doris Young deliberately targeted him, and he did not even offend her!\r\n\r\nHarold couldn't help asking the Old Mrs. Willson: 'Grandma, the director's appointment has been announced, you won't regret it?'\r\n\r\nOld Mrs. Willson struggled to stand up, raised her hand and slapped him, angrily\r\nscolded: 'b*stard stuff, you still don't want to miss the directorship, even at such a time!'\r\n\r\nChapter 22\r\nAfter Charlie went out, he realized that Claire hadn't gone far, just squatting in an unmanned corner next to the hotel, crying aggrievedly.\r\n\r\nHe slowly approached, took off his coat, put on Claire, and said: 'My wife, don't be sad, the director of the Willson family is not a treasure, no matter it's inappropriate for your family to treat you like that.'\r\n\r\n'You don't understand, if I become the director, my parents will be able to raise their eyes in the Willson family, how can grandma turn back,' Claire whimpered.\r\n\r\nCharlie continued to persuade: 'Maybe they will have to come and beg you to be the director. You are crying like this now, and you won't look pretty after a while on stage.'\r\n\r\nClaire choked and said, 'How is it possible? Grandma has said everything, and there will be no chance of turning back. Leave me, let me be alone.'\r\n\r\nAt this moment, Mrs. Willson and Harold also ran out of the banquet hall.\r\n\r\nThe Lady Willson was too old and out of breath when she ran. A large group of people behind her came out to watch the scene in excitement.\r\n\r\nAfter Harold came out, he saw Charlie and Claire.\r\n\r\nHe ran forward quickly, looked down at Claire with dim eyes, and blurted out: 'Claire, hurry up and chase Miss Doris, let her not terminate cooperation with us!'\r\n\r\nClaire looked blank: 'Terminate cooperation? Why?'\r\n\r\nHarold said angrily: 'You are here pretending to be innocent. You must have instructed Miss Doris to embarrass me publicly. If you don't settle this matter for me, I can't spare you!'\r\n\r\nSnapped!\r\n\r\nThe Old Mrs. Willson who was on the side slapped Harold angrily again and said 'You b@stard, how can you talk to your sister like that! She is the director of our Willson Group!'\r\n\r\nHarold was anxious: 'Didn't grandma chose me as the director?'\r\n\r\nThe Old Mrs. Willson said angrily: 'If you hadn't given me Ecstasy, how could I change my mind temporarily? If you continue to be reluctant, get out of the Willson family!'\r\n\r\nAfter being smoked twice by the Lady Willson, Harold was extremely angry, but he dared not speak, so he could only swallow his anger temporarily.\r\n\r\nThe Old Mrs. Willson said to Claire again at this time: 'Claire, grandma begs you, you are now the director of the Willson family, hurry up and explain to Miss Doris, otherwise, our Willson family will be in ruins!'\r\n\r\nClaire looked at Charlie blankly with doubts.\r\n\r\nCharlie shrugged and said, 'I told you, they have to come and beg you to be the director in a while, you didn't believe me, look, your face is all messed up.'\r\n\r\nClaire blushed, wiped her tears, and said, 'Then I will try to contact Emgrand.' After speaking, she dialed Doris Young's phone.\r\nEveryone's eyes focused on her.\r\n\r\nAfter a while, the phone was connected, and Claire said: 'Hello, Miss Doris, grandma asked me to explain to you, I will be promoted to the director of the Willson family, responsible for the cooperation with Emgrand, can you give us another chance? '\r\n\r\nDoris Young chuckled and said, 'If you are the director and can take the charge then there is no problem. The cooperation can continue, but if it is someone else, everything stays at the current status.'\r\n\r\n'Miss Doris thank you so much!'\r\n\r\nClaire was always puzzled about this matter in her heart. From beginning to end, the Emgrand Group seemed to be here entirely to help her, which was too abnormal.\r\n\r\nDoris Young said with a smile: 'This is what our chairman meant. If there is a chance in the future, the chairman will explain it to you personally.'\r\n\r\nClaire was even more puzzled. Who was the chairman of the other party, and she had never seen him. Why did the other party help him everywhere?\r\n\r\n'Then, can you please return to the banquet hall again?' Claire asked nervously.\r\n\r\nThe other party had left with anger, obviously irritated by the Willson family. At this time, asking the other party to come back is a bit difficult.\r\n\r\nBut she didn't expect that Doris Young agreed resolutely.\r\n\r\nSoon everyone saw that Doris Young's car had returned to the door of the hotel. At this moment, everyone looked at Claire's gaze, all filled with horror and awe.\r\nChapter 23\r\nWhen everyone returned to the banquet hall, the Lady Willson took Claire's hand on the stage.\r\n\r\nWith an intimate gesture, she said, 'I'm really sorry for just now, it was me who made a mistake, in fact, thanks to Claire this time, she is the outstanding descendant of our\r\n\r\nWillson family. This time the cooperation between the Willson family and the Emgrand resulted from the efforts of Claire. She really made great efforts.'\r\n\r\nDoris Young stood by her side, glanced at her disdainfully, waved her hand to stop her from speaking further, and said: 'I will correct it. In this cooperation, Miss Claire has not only made great efforts, but completely it is made possible by her power, and has\r\nnothing to do with other people.'\r\n\r\nThis is extremely rude, but everyone is accustomed to it. With the status of an emperor, even if Doris Young slaps the Lady Willson in public, she dare not say anything.\r\n\r\nThe Old Mrs. Willson nodded quickly and said: 'Vice-chair Doris is right. For everything, the credit goes to Claire. From now on, Claire will be the director of the Willson family's business! Fully responsible for the cooperation between the Willson family and the Emgrand Group!'\r\n\r\nDoris Young showed a slight smile and shook hands with Claire and said, 'I hope we can cooperate happily in the future.'\r\n\r\nClaire was still a little at loss, and could only nod her confused head.\r\n\r\nThe audience burst into thunderous applause, and everyone looked at Claire's eyes, also full of enthusiasm.\r\n\r\nThis woman, who is on the list! The Emgrand Group treats her so seriously!\r\n\r\nClaire herself was also confused. She turned her head to look at Charlie. The situation at this time was exactly the same as what Charlie had just said. Old Mrs. Willson returned the position of director that should belong to her.\r\n\r\nUntil the banquet was over, Claire was still in a daze after returning home.\r\n\r\nRecalling what Charlie had said before, she couldn't help but feel a little puzzled. In the past few days, Charlie seemed to have become a little different.\r\n\r\nThere seemed to be many things on his body that she didn't understand, like it was covered by layers of mist.\r\n\r\nThis night, Claire became famous in Aurous Hill!\r\n\r\nEveryone knows that there is an outstanding junior from the Willson family, and the Emgrand Group is on her back!\r\n\r\nIt seems that with her, the revitalization of the Willson family is just around the corner The next morning, Claire woke up early and hurried to the company refreshed.\r\nToday is her first day as a director. She hopes that she can go all out to do this thing well.\r\n\r\nAfter Charlie got up, he started to do housework as always.\r\n\r\nWhen Charlie finished his housework and was about to go to the vegetable market to buy vegetables for lunch, he suddenly received a call from his mother-in-law Elaine.\r\n\r\nAfter answering the call, the mother-in-law's extremely anxious voice came from over there: 'Charlie, within ten minutes, you must rush to the safe road for me, otherwise I won't spare you when I go home!'\r\n\r\nAfter that, she hung up the phone.\r\n\r\nCharlie was confused. The mother-in-law didn't say anything early in the morning. At this moment, she called suddenly, as if something urgent had happened.\r\n\r\nAlthough Charlie was very disgusted with his mother-in-law, he did not dare to neglect her orders. After hurriedly cleaning up, he went out to take a taxi and rushed to Safe Road.\r\n\r\nWhen he got out of the car, he saw a group of grandpas and aunts surrounded aggressively at the door of a closed insurance company.\r\n\r\nAnd his mother-in-law stood at the forefront of the team, holding a banner in her hand, shouting angrily: 'Rubbish Harley, Fake platform, We Want Our Rights, and pay back my hard-earned money!'\r\n\r\nCharlie hurriedly stepped forward and asked: 'Mom, you called me over, what's the matter?'\r\n\r\nAs he was speaking, the condemning slogans sounded in his ear again, the grandfathers and aunts shouted hoarsely that rang the eardrums of the passerby's.\r\n\r\nElaine pulled Charlie over, asked him to take her place, and then ordered: 'Come on, shout this slogan for me, I have been yelling it all morning, and my voice has become hoars.'\r\n\r\nChapter 24\r\nCharlie didn't know why, but he could only protest with a few uncles and aunts. When shouting slogans, he inquired with an uncle next to him from time to time, and then he understood what was going on.\r\n\r\nIt turned out that this Harley Insurance Co., Ltd. offered insurance products with extremely high return rates.\r\n\r\nAnd this elderly were attracted by the high rate of return. Everyone bought a lot of insurance products under the company's name and became their customers.\r\n\r\nThis is the fixed time to pay dividends. Unexpectedly, when these elders and aunts came to withdraw cash, they discovered that the door of the company was closed, and only a few employees were at the door, using botched excuses to prevaricate everyone.\r\n\r\nThis gang of grandpas and aunts realized that they were deceived by the empty gloved white wolf.\r\n\r\nNo wonder the mother-in-law wanted to call him over in a hurry and asked him to participate with him.\r\n\r\nThinking of this, Charlie grew big and couldn't help but ask his mother-in-law: 'Mom, how much insurance did you buy?'\r\n\r\nElaine said anxiously: 'They told me that buying the insurance products will bring me a lot of dividends, my head got dizzy and I bought all of their products with all the money from home.'\r\n\r\nCharlie was taken aback, 'What? All the money from home used to buy insurance?'\r\n\r\nAfter hearing this sentence, Elaine immediately became irritated and cursed: 'Just do you have a mouth? Do you think I am not embarrassed enough? Why speak so loudly?!'\r\n\r\nAs she spoke, she continued her carping and said, 'If you had brought me some profit I would not have bought the products of this insurance company. With a wast son in law like you at the house, what else were my options for the money at home?'\r\n\r\nThis guy, it's okay when he does not support the family. But now he is laughing at her, as if he'd made fortunes with that money.\r\n\r\nImmediately, she said to Charlie: 'I am telling you, keep chanting slogans here to help me, you can't stop for a moment!'\r\n\r\nCharlie couldn't help but nodded and said, 'Okay mom.'\r\n\r\nAt this moment, several aunts came over, looked up and down Charlie, then asked Elaine: 'Sister Elaine, is this your son-in-law?'\r\n\r\nAs they spoke, they scanned Charlie's clothes again, shook their head, and laughed:\r\n'Why does he look so poor? he does not look like a son-in-law material from any angle.' 'Yes, this dress is worn too many times! It can't compare to that of Lady Willson!'\r\nSome people are so good at disparaging, the ridicule in and out of the words is particularly harsh.\r\n\r\nCharlie didn't care. They were all old ladies who had fallen into the soil up to half of their bodies. Now they have lost their savings for a lifetime, so he doesn't need to exchange words with them.\r\n\r\nElaine was also very angry at this time, and the more Charlie looked at it, the more unpleasant she was. She blurted out: 'Look at him, I'll let my daughter divorce him in a few days! Change her future with a new son-in-law!'\r\n\r\nCharlie sneered in his heart. If you add the rich second generations of Aurous Hill in, it can't be compare with his half finger.\r\n\r\nElaine was anxiously worried at this time, Charlie was a waste, and at most he could shout slogans for her.\r\n\r\nIf she wants to invest back, she still needs someone with real ability to come and help solve it.\r\n\r\nIt's a pity that Wendell Jones's family who has been pursuing her daughter has gone bankrupt. Otherwise, She could ask them to help!\r\n\r\ncorrect!\r\n\r\nElaine suddenly remembered that Gerald's brother, Fred, whom she met at the family banquet yesterday is her hope.\r\n\r\nJudging from his attitude towards her daughter at the time, it is estimated that he had some thoughts about Claire.\r\n\r\nAlthough the White family is not as good as the previous Jones family, it is still a big family. If she calls him over, there should be a way.\r\n\r\nIt just so happened that Fred White left his Business card yesterday, so she took her phone out and dialed Fred's number.\r\n\r\nChapter 25\r\nThe call got connected soon.\r\n\r\nElaine said, 'Hey, is it Fred? This is Clair's mother.'\r\n\r\nEver since Fred White saw Claire at the banquet, he was shocked as a heavenly man and never forgot about her.\r\n\r\nHe was worried that he had no chance to get close to Claire, and it happened that Claire's mother called herself.\r\n\r\nHe speculated that Elaine was in trouble, and of course he would not let go of this opportunity for courtesy.\r\n\r\nSo, he immediately greeted politely: 'Aunt Elaine, is everything Okay?' 'Well, there is something Auntie needs your help for.'\r\nElaine hurriedly said: 'Fred, a few old sisters and I bought some wealth management products from an insurance company called Harley, and the wealth of the family has been invested in it, but now this company does not allow withdrawals. Can you find a way to help Auntie get the money back?'\r\n\r\nAfter listening, Fred was overjoyed. He felt that it was time to perform and said\r\nconfidently: 'Auntie, don't worry, I will come to you now and I will definitely help you solve this matter!'\r\n\r\nElaine was immediately excited, and hurriedly said, 'Thank you so much!'\r\n\r\nHanging up the phone, she looked at Charlie again and said angrily: 'Some people don't have any abilities, just can't count on them. Besides shouting two slogans, what are they for? Utterly useless.'\r\n\r\nCharlie sneered after listening, this mother-in-law was really snobbish and blind. She called Fred for help?\r\nThis company has defrauded at least tens of millions or more of funds. Those who dare to swindle so much money must have a very strong backing. Itis even possible that they are bigwigs in the underground world.. How could Fred White let scammers spit out the money?\r\n\r\nThe White family's strength is very average. After the Emgrand Group ceased\r\ncooperation, its strength has shrunk even more. With the White family's background, it is basically impossible to interfere in such a large financial fraud.\r\n\r\nIn fact, this little matter can be solved immediately by calling Issac Craven from Shangri- La.\r\n\r\nAfter all, he is the spokesperson of the Wade family in Aurous Hill, and any Aurous Hill entrepreneur or big figure in black and white must give him enough face.\r\n\r\nHowever, my mother-in-law is really hateful. Since she believes in Fred White, let Fred White help her. Let's see what he can do for her.\r\n\r\nWhen someone saw Elaine made a phone call, they immediately smiled, and immediately surrounded her and asked her if she had found any important figure to help them out?\r\n\r\nElaine proudly said to a group of old ladies and men around her'Don't worry, I asked the eldest master of the White family to come and help. Hey will make some calls, and our hard-earned money will be returned hopefully.'\r\n\r\nSomeone exclaimed, 'The eldest young master of the White family? Or sister, you are great, you can find such a great personality.'\r\n\r\n'Yes, then Young Mr. White must have a lot of contacts. To solve our problem, isn't it just a matter of a few words?'\r\n\r\n'Sister, since you have such good contacts, why didn't you marry your daughter to someone like him, instead of giving your daughter to such a sh!t?'\r\n\r\nElaine glanced at Charlie disdainfully, and snorted coldly: 'This kind of waste will be swept out by our Willson family sooner or later!'\r\n\r\nCharlie didn't say a word, planning to wait for Fred White to come to see how he hit the wall.\r\n\r\nSoon, a black Porsche slowly stopped in front of everyone.\r\n\r\nA young man in a suit and leather shoes, with seemingly talented looks came out of the car.\r\n\r\nFred White is here.\r\n\r\nThe old men and women all around were sighing: 'Oh, look at people, this is a young talent! Such a good son-in-law, I don't know who's daughter will be lucky in the future to be his wife.'\r\n\r\nChapter 26\r\n'Yeah! If my daughter could marry him, I would die of happiness!'\r\n\r\n'Bah, stop dreaming! Even if you die, people won't look down on your girl!'\r\n\r\nAt this moment, Elaine saw Fred White at once, and immediately ran forward, and said eagerly: 'Oh, Fred, you are here, your aunt is going to die!'\r\n\r\nThe person here is Fred White.\r\n\r\nFred White smiled and said, 'Auntie, I'm sorry, I have kept you waiting!'\r\n\r\nElaine hurriedly said: 'Oh, Fred, you are so polite. Auntie didn't wait for ten minutes. You came so fast!'\r\n\r\nFred White smiled and said, 'I heard that you were in trouble, so I drove over and ran through several red lights along the way.'\r\n\r\nElaine looked smug, but asked with concern, 'Isn't it troublesome to run so many red lights?'\r\n\r\n'No.' Fred White said calmly: 'The traffic team in the city are all acquaintances, and a phone call can eliminate any violation.'\r\n\r\nAfter speaking, Fred White said again: 'Let's talk about you! How much money have you been cheated off?'\r\n\r\nElaine sighed and said, 'A total of more than one million has been invested. It is said that this month's dividends can get 200,000, but the principal cannot be raised.'\r\n\r\nFred White nodded and said in a boisterously: 'Don't worry, I will handle this matter. If I go out, I will definitely help you get the money back.'\r\n\r\nAfter speaking, he suddenly saw Charlie standing behind Elaine, and his face changed slightly.\r\n\r\nUnexpectedly, Charlie, an eye-catching waste, was there.\r\n\r\nSince seeing Claire, Fred White's thoughts of her moved in his heart. After hearing his younger brother Gerald White said that Claire should still be single, this thought in his heart was even stronger.\r\n\r\nTherefore, seeing Claire's rubbish husband, he naturally sneered.\r\n\r\nHe deliberately smiled and said: 'Oh, Brother Wade is here, do you have a way to help Aunt Elaine get back the investment? Or do you give it a try first? You won't turn around and blame me for stealing your limelight.'\r\n\r\nElaine hurriedly said, 'Let him try a bullsh*t, what can he do to help? He can just open his mouth and help shout some slogans! Fred, leave him alone.'\r\n\r\nFred White nodded and said sarcastically: 'Since Brother Wade doesn't have this ability, then I will give it a try!'\r\n\r\nCharlie smiled slightly and said: 'Mr. Fred, come on, you can do it.'\r\n\r\nFred White laughed disdainfully. At this time, the gang of grandpas and aunts around Elaine gathered one by one, chanting on Elaine, and said: 'Elaine, can you let this little handsome guy also help us! All of us were cheated of hard-earned money!'\r\n\r\nElaine arrogantly said, 'Oh, I can't be ask him for that. Fred is giving me a favor, but he doesn't know you.'\r\n\r\nOthers pleaded with Fred White: 'Mr. White, you are so great, please help us too!'\r\n\r\nFred White dismissed other people but saw that Elaine loves petty things and\r\ncheapness, so he smiled and said, 'Since everyone is Aunt's friends, then I can do you a favor.'\r\n\r\nWhen everyone was overjoyed, Fred White looked arrogantly and said: 'It's just that I am helping you because of Aunt Elaine. Therefore, you must pay Aunt 10% for the money I get for you. Is it acceptable?'\r\n\r\nOthers hurriedly said, 'No problem! It's a lot better to get a return of 90 than nothing!'\r\n\r\nAs soon as Elaine heard this, she was immediately happy!\r\n\r\nThe money adds up to tens of millions considering all. If Fred White can really help to get it back, wouldn't she make millions?\r\n"
        },
        {
          "id": "episode-25-30",
          "name": "Episode 25 to 30",
          "type": "file",
          "content": ""
        },
        {
          "id": "episode-30-35",
          "name": "Episode 30 to 35",
          "type": "file",
          "content": ""
        }
      ]
    },
    {
      "id": "ebook-2",
      "name": "Python Programming Handbook",
      "type": "folder",
      "children": [
        {
          "id": "episode-2-1",
          "name": "Chapter 1: Python Basics",
          "type": "file",
          "content": "Chapter 1: Python Basics\n==========================\n\nWelcome to the Python Programming Handbook. Let's start with the fundamentals.\n\nWhat is Python?\nPython is a high-level, interpreted programming language known for its simplicity and readability. It's widely used in web development, data science, and automation.\n\nInstalling Python:\nVisit python.org and download the latest version. Make sure to add Python to your system PATH.\n\nYour First Program:\nprint(\"Hello, World!\")\n\nVariables and Data Types:\nname = \"Alice\"\nage = 30\nheight = 5.8\nis_student = False\n\nStrings:\n# Single or double quotes\ngreeting = \"Hello, Python!\"\n\n# String methods\nmessage = \"python programming\"\nprint(message.upper())  # PYTHON PROGRAMMING\nprint(message.capitalize())  # Python programming\nprint(len(message))  # 18\n\n# String formatting\nname = \"Bob\"\nprint(f\"Hello, {name}!\")  # Hello, Bob!\n\nNumbers:\n# Integer\ncount = 42\n\n# Float\npi = 3.14159\n\n# Math operations\nresult = 10 + 5 * 2\nprint(result)  # 20\n\n# Power operator\nprint(2 ** 3)  # 8\n\nLists:\n# Create a list\nnumbers = [1, 2, 3, 4, 5]\n\n# Add items\nnumbers.append(6)\n\n# Access items\nprint(numbers[0])  # 1\n\n# List slicing\nprint(numbers[1:3])  # [2, 3]\n\n# List methods\nnumbers.remove(3)\nnumbers.sort()\nprint(len(numbers))\n\nDictionaries:\nperson = {\n  \"name\": \"Charlie\",\n  \"age\": 28,\n  \"city\": \"San Francisco\"\n}\n\n# Access values\nprint(person[\"name\"])  # Charlie\n\n# Add/modify\nperson[\"age\"] = 29\nperson[\"job\"] = \"Engineer\"\n\n# Keys and values\nprint(person.keys())\nprint(person.values())\n\nTuples:\n# Immutable sequences\ncoordinates = (10, 20)\nprint(coordinates[0])  # 10\n\n# Unpacking\nx, y = coordinates\n\nConditionals:\nage = 25\n\nif age >= 18:\n  print(\"Adult\")\nelif age >= 13:\n  print(\"Teenager\")\nelse:\n  print(\"Child\")\n\nLoops:\n# For loop\nfor i in range(5):\n  print(i)\n\n# While loop\ncount = 0\nwhile count < 5:\n  print(count)\n  count += 1\n\n# Loop through list\nfruits = [\"apple\", \"banana\", \"cherry\"]\nfor fruit in fruits:\n  print(fruit)\n\nFunctions:\ndef greet(name):\n  return f\"Hello, {name}!\"\n\nmessage = greet(\"Diana\")\nprint(message)  # Hello, Diana!\n\n# Default parameters\ndef welcome(name, age=18):\n  return f\"{name} is {age} years old\"\n\nNext Episode: Working with Files and Modules\nKeep coding!"
        },
        {
          "id": "episode-2-2",
          "name": "Chapter 2: File Handling and Modules",
          "type": "file",
          "content": "Chapter 2: File Handling and Modules\n=====================================\n\nIn this chapter, we learn how to work with files and use Python modules.\n\nReading Files:\n# Read entire file\nwith open(\"data.txt\", \"r\") as file:\n  content = file.read()\n  print(content)\n\n# Read line by line\nwith open(\"data.txt\", \"r\") as file:\n  for line in file:\n    print(line.strip())\n\n# Read all lines into list\nwith open(\"data.txt\", \"r\") as file:\n  lines = file.readlines()\n\nWriting Files:\n# Write to file (creates or overwrites)\nwith open(\"output.txt\", \"w\") as file:\n  file.write(\"Hello, File!\")\n\n# Append to file\nwith open(\"output.txt\", \"a\") as file:\n  file.write(\"\\nNew line\")\n\nFile Modes:\n- \"r\" - Read (default)\n- \"w\" - Write (overwrites)\n- \"a\" - Append (adds to end)\n- \"x\" - Create (fails if exists)\n- \"b\" - Binary mode\n- \"t\" - Text mode (default)\n\nException Handling:\ntry:\n  file = open(\"data.txt\", \"r\")\n  content = file.read()\nexcept FileNotFoundError:\n  print(\"File not found!\")\nexcept IOError:\n  print(\"Error reading file\")\nfinally:\n  file.close()\n\nImporting Modules:\n# Import entire module\nimport math\nprint(math.pi)\n\n# Import specific items\nfrom math import sqrt, pi\nprint(sqrt(16))  # 4.0\n\n# Import with alias\nimport numpy as np\n\n# List available functions\nimport math\nprint(dir(math))\n\nCommon Modules:\n1. math - Mathematical functions\n2. random - Random number generation\n3. datetime - Date and time\n4. os - Operating system interaction\n5. sys - System-specific parameters\n6. json - JSON encoding/decoding\n\nWorking with JSON:\nimport json\n\n# Write JSON\ndata = {\"name\": \"Eve\", \"age\": 26}\nwith open(\"data.json\", \"w\") as file:\n  json.dump(data, file)\n\n# Read JSON\nwith open(\"data.json\", \"r\") as file:\n  data = json.load(file)\n  print(data[\"name\"])\n\nDatetime:\nfrom datetime import datetime, timedelta\n\nnow = datetime.now()\nprint(now)\n\n# Add days\ntomorrow = now + timedelta(days=1)\n\n# Format date\nprint(now.strftime(\"%Y-%m-%d\"))\n\nRandom:\nimport random\n\n# Random number\nnum = random.randint(1, 100)\n\n# Random choice\ncolors = [\"red\", \"blue\", \"green\"]\nchoice = random.choice(colors)\n\n# Shuffle list\nrandom.shuffle(colors)\n\nCreating Your Own Module:\n# Save as my_module.py\ndef add(a, b):\n  return a + b\n\ndef subtract(a, b):\n  return a - b\n\n# Use in another file\nimport my_module\nresult = my_module.add(5, 3)\n\nNext Episode: Object-Oriented Programming\nHappy coding!"
        }
      ]
    },
    {
      "id": "ebook-3",
      "name": "React & Next.js Fundamentals",
      "type": "folder",
      "children": [
        {
          "id": "episode-3-1",
          "name": "Lesson 1: React Basics",
          "type": "file",
          "content": "Lesson 1: React Basics\n========================\n\nIntroduction to React - A JavaScript library for building user interfaces.\n\nWhat is React?\nReact is a JavaScript library developed by Facebook for building fast, interactive user interfaces using components.\n\nWhy React?\n- Component-based - Reusable code\n- Virtual DOM - Efficient updates\n- One-way data flow - Predictable code\n- Large ecosystem - Many libraries available\n\nJSX - JavaScript XML:\nJSX lets you write HTML-like code in JavaScript.\n\nconst element = <h1>Hello, React!</h1>;\n\nJSX gets compiled to JavaScript:\nconst element = React.createElement('h1', null, 'Hello, React!');\n\nComponents:\nComponents are reusable pieces of UI. There are two types: functional and class components.\n\nFunctional Components:\nfunction Welcome(props) {\n  return <h1>Hello, {props.name}!</h1>;\n}\n\n// Using arrow function\nconst Greeting = (props) => {\n  return <p>Welcome back!</p>;\n};\n\nJSX Expressions:\nconst name = \"Sarah\";\nconst element = <h1>Hello, {name}!</h1>;\n\n// Expressions\nconst age = 25;\n<p>You are {age > 18 ? \"an adult\" : \"a minor\"}</p>\n\nRendering Components:\nimport ReactDOM from 'react-dom';\n\nconst App = () => <h1>My React App</h1>;\n\nReactDOM.render(<App />, document.getElementById('root'));\n\nProps - Passing Data:\nProps are arguments passed to components.\n\nfunction Greeting(props) {\n  return <p>Hello, {props.name}!</p>;\n}\n\n<Greeting name=\"John\" />\n<Greeting name=\"Jane\" />\n\nProps are read-only - don't modify them.\n\nState - Managing Data:\nState lets components manage their own data that can change.\n\nimport { useState } from 'react';\n\nfunction Counter() {\n  const [count, setCount] = useState(0);\n  \n  return (\n    <div>\n      <p>Count: {count}</p>\n      <button onClick={() => setCount(count + 1)}>\n        Increment\n      </button>\n    </div>\n  );\n}\n\n// useState returns [currentValue, function to update]\n// Initial value goes inside useState()\n\nEvents:\nfunction ButtonClick() {\n  const handleClick = () => {\n    console.log('Clicked!');\n  };\n  \n  return (\n    <button onClick={handleClick}>\n      Click me\n    </button>\n  );\n}\n\n// Pass parameters\n<button onClick={() => handleClick(id)}>Delete</button>\n\nCommon Events:\n- onClick\n- onChange\n- onSubmit\n- onFocus\n- onBlur\n- onHover\n- onKeyDown\n\nConditional Rendering:\nfunction LoginStatus(props) {\n  if (props.isLoggedIn) {\n    return <p>Welcome back!</p>;\n  }\n  return <p>Please log in</p>;\n}\n\n// Using ternary operator\n<p>{isLoggedIn ? 'Welcome' : 'Login'}</p>\n\n// Using logical AND\n<p>{isAdmin && 'Admin Panel'}</p>\n\nLists and Keys:\nfunction ItemList(props) {\n  return (\n    <ul>\n      {props.items.map((item) => (\n        <li key={item.id}>{item.name}</li>\n      ))}\n    </ul>\n  );\n}\n\n// Always use a unique 'key' prop when rendering lists\n\nNext Episode: Hooks and Advanced State Management\nSee you in the next episode!"
        },
        {
          "id": "episode-3-2",
          "name": "Lesson 2: React Hooks",
          "type": "file",
          "content": "Lesson 2: React Hooks\n=====================\n\nUnderstanding React Hooks - Functions that let you use state and other features.\n\nWhat are Hooks?\nHooks are functions that let you \"hook into\" React state and lifecycle features from functional components.\n\nRules of Hooks:\n1. Only call hooks at the top level\n2. Only call hooks from React functions\n3. Don't call hooks conditionally\n\nCommon Hooks:\n\n1. useState - Add state to functional components\n\nimport { useState } from 'react';\n\nfunction Counter() {\n  const [count, setCount] = useState(0);\n  \n  return (\n    <div>\n      <p>{count}</p>\n      <button onClick={() => setCount(count + 1)}>+</button>\n    </div>\n  );\n}\n\n2. useEffect - Perform side effects\n\nimport { useEffect, useState } from 'react';\n\nfunction Example() {\n  const [count, setCount] = useState(0);\n  \n  useEffect(() => {\n    // This runs after every render\n    document.title = `Count: ${count}`;\n  });\n  \n  return <div>{count}</div>;\n}\n\n// With dependency array\nuseEffect(() => {\n  // This runs only once after mount\n  console.log('Component mounted');\n}, []);\n\n// With dependencies\nuseEffect(() => {\n  // This runs when count changes\n  console.log('Count changed:', count);\n}, [count]);\n\n// Cleanup function\nuseEffect(() => {\n  const timer = setInterval(() => {\n    console.log('Tick');\n  }, 1000);\n  \n  return () => clearInterval(timer);\n}, []);\n\n3. useContext - Share data between components\n\nimport { createContext, useContext } from 'react';\n\nconst ThemeContext = createContext();\n\nfunction App() {\n  const [theme, setTheme] = useState('light');\n  \n  return (\n    <ThemeContext.Provider value={theme}>\n      <Header />\n      <Content />\n    </ThemeContext.Provider>\n  );\n}\n\nfunction Content() {\n  const theme = useContext(ThemeContext);\n  return <div style={{background: theme === 'light' ? '#fff' : '#000'}}></div>;\n}\n\n4. useRef - Create references to DOM elements\n\nimport { useRef } from 'react';\n\nfunction TextInput() {\n  const inputRef = useRef(null);\n  \n  const focusInput = () => {\n    inputRef.current.focus();\n  };\n  \n  return (\n    <>\n      <input ref={inputRef} />\n      <button onClick={focusInput}>Focus</button>\n    </>\n  );\n}\n\n5. useReducer - Complex state management\n\nimport { useReducer } from 'react';\n\nconst initialState = { count: 0 };\n\nfunction reducer(state, action) {\n  switch(action.type) {\n    case 'INCREMENT':\n      return { count: state.count + 1 };\n    case 'DECREMENT':\n      return { count: state.count - 1 };\n    default:\n      return state;\n  }\n}\n\nfunction Counter() {\n  const [state, dispatch] = useReducer(reducer, initialState);\n  \n  return (\n    <div>\n      <p>{state.count}</p>\n      <button onClick={() => dispatch({ type: 'INCREMENT' })}>+</button>\n      <button onClick={() => dispatch({ type: 'DECREMENT' })}>-</button>\n    </div>\n  );\n}\n\nCustom Hooks:\nYou can create your own hooks to reuse logic.\n\nfunction useForm(initialValues) {\n  const [values, setValues] = useState(initialValues);\n  \n  const handleChange = (e) => {\n    const { name, value } = e.target;\n    setValues(prev => ({ ...prev, [name]: value }));\n  };\n  \n  return { values, handleChange };\n}\n\nfunction LoginForm() {\n  const { values, handleChange } = useForm({ email: '', password: '' });\n  \n  return (\n    <form>\n      <input name=\"email\" value={values.email} onChange={handleChange} />\n      <input name=\"password\" value={values.password} onChange={handleChange} />\n      <button type=\"submit\">Login</button>\n    </form>\n  );\n}\n\nNext Episode: Context API and Global State\nKeep learning!"
        }
      ]
    }
  ]
}
